export default class MainApi {
  // Отвечает за взаимодействие с написанным вами Node.js API.
  // Конструктор этого класса принимает опции, необходимые для инициализации работы с API

  // signup() {
  // // регистрирует нового пользователя;

  // }

  // signin(){
  // // аутентифицирует пользователя на основе почты и пароля;

  // }

  // getUserData(){
  // // возвращает информацию о пользователе;

  // }

  // getArticles() {
  // // забирает все статьи;

  // }

  // createArticle() {
  // // создаёт статью;

  // }
  // removeArticle() {
  // // удаляет статью.

  // }
}
