export default class Header {
  // // Класс, отвечающий за логику работы шапки сайта.
  // // Его конструктор принимает объект опций.
  // // В опциях передается цвет шапки, так как на разных страницах он может быть разный.

  // constructor() {

  // }

  // render({ props }) {
  // // при вызове метода перерисовывает шапку в зависимости от объекта props.
  // // У этого объекта есть два обязательных свойства:
  // // isLoggedIn — залогинен ли пользователь;
  // // userName — имя, которое отображается в шапке залогиненного пользователя.

  // }
}
